---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ReportsFolder
source: html/fe7d556f-988a-9293-5fbd-651cd3690346.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ReportsFolder Property

The folder path where all systems analysis reports are stored. It may include special label and relative path.

## Syntax (C#)
```csharp
public string ReportsFolder { get; }
```